{
    "pagination": {
      "limit": 25,
      "offset": 0,
      "count": 25,
      "total": 10000
    },
    "data": [
      {
        "author": "Ciaran Wiseman",
        "title": "Sir Jim Ratcliffe makes brutal comment about Man United squad days after Erik ten Hag sacked",
        "description": "Sir Jim Ratcliffe makes brutal comment about Man United squad days after Erik ten Hag sacked",
        "url": "https://talksport.com/football/2219642/jim-ratcliffe-man-united-squad/",
        "source": "TalkSport",
        "image": null,
        "category": "sports",
        "language": "en",
        "country": "gb",
        "published_at": "2024-11-03T13:48:46+00:00"
      },
      {
        "author": "Emily Chan",
        "title": "A Newly Discovered Prehistoric Mammal That Lived Among Dinosaurs May Have Been A Swamp-Dweller",
        "description": "Discovered in Colorado, a new prehistoric mammal species that lived during the age of the dinosaurs may have been a swamp-dweller. A team of paleontologists found the fossils near Rangely, Colorado, in the northwest of the state, and dated them to about 70 million to 75 million years ago during the Late Cretaceous period. The [&#8230;]",
        "url": "https://www.chipchick.com/2024/11/a-newly-discovered-prehistoric-mammal-that-lived-among-dinosaurs-may-have-been-a-swamp-dweller",
        "source": "chipchick",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:40+00:00"
      },
      {
        "author": "OÖ Volksblatt",
        "title": "In Italien wird eine TV-Serie über den Fall Amanda Knox gedreht",
        "description": "Die Mordvorwürfe gegen Amanda Knox sorgten vor 17 Jahren weltweit für Aufregung &#8211; nun dreht die US-Amerikanerin eine TV-Serie über den Mord im italienischen Perugia, bei dem 2007 die britische Austauschstudentin Meredith Kercher ums Leben kam. Auch die Stadt Perugia selbst soll Schauplatz einer Fernsehserie werden, die für Hulu, den Streaming-Kanal von Disney, gedreht wird, [&#8230;]Der Beitrag In Italien wird eine TV-Serie über den Fall Amanda Knox gedreht erschien zuerst auf Oberösterreichisches Volksblatt.",
        "url": "https://volksblatt.at/kultur-medien/in-italien-wird-eine-tv-serie-ueber-den-fall-amanda-knox-gedreht-1672923/",
        "source": "volksblatt",
        "image": "https://volksblatt.at/wp-content/uploads/2024/11/ITALY-JUSTICE-US-KNOX--e1730641525944-300x103.jpg",
        "category": "general",
        "language": "de",
        "country": "at",
        "published_at": "2024-11-03T13:48:38+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Acquires 25,345 Shares of Churchill Downs Incorporated (NASDAQ:CHDN)",
        "description": "Harbor Capital Advisors Inc. raised its holdings in Churchill Downs Incorporated (NASDAQ:CHDN - Free Report) by 127.6% in the 3rd quarter, according to the company in its most recent 13F filing with the SEC. The fund owned 45,202 shares of the company's stock after purchasing an additional 25,345 s",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-chdn-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:34+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Acquires 42,779 Shares of Axcelis Technologies, Inc. (NASDAQ:ACLS)",
        "description": "Harbor Capital Advisors Inc. grew its stake in Axcelis Technologies, Inc. (NASDAQ:ACLS - Free Report) by 243.8% in the third quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The fund owned 60,328 shares of the semiconductor company's stock after bu",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-acls-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:33+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Increases Stock Holdings in Arrow Electronics, Inc. (NYSE:ARW)",
        "description": "Harbor Capital Advisors Inc. boosted its stake in Arrow Electronics, Inc. (NYSE:ARW - Free Report) by 57.7% during the third quarter, according to its most recent 13F filing with the SEC. The firm owned 46,394 shares of the technology company's stock after acquiring an additional 16,981 shares duri",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-arw-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:33+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Boosts Stake in Casella Waste Systems, Inc. (NASDAQ:CWST)",
        "description": "Harbor Capital Advisors Inc. boosted its holdings in Casella Waste Systems, Inc. (NASDAQ:CWST - Free Report) by 108.0% in the 3rd quarter, according to its most recent Form 13F filing with the SEC. The institutional investor owned 66,129 shares of the industrial products company's stock after acqu",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-cwst-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:32+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Grows Stock Holdings in Assured Guaranty Ltd. (NYSE:AGO)",
        "description": "Harbor Capital Advisors Inc. lifted its stake in shares of Assured Guaranty Ltd. (NYSE:AGO - Free Report) by 96.6% during the third quarter, according to the company in its most recent Form 13F filing with the SEC. The firm owned 81,560 shares of the financial services provider's stock after acquir",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-ago-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:32+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Purchases 111,185 Shares of Option Care Health, Inc. (NASDAQ:OPCH)",
        "description": "Harbor Capital Advisors Inc. grew its position in Option Care Health, Inc. (NASDAQ:OPCH - Free Report) by 115.4% during the third quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission (SEC). The institutional investor owned 207,560 shares of th",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-opch-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:32+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Grows Stake in The Hackett Group, Inc. (NASDAQ:HCKT)",
        "description": "Harbor Capital Advisors Inc. raised its stake in shares of The Hackett Group, Inc. (NASDAQ:HCKT - Free Report) by 150.2% during the third quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission (SEC). The firm owned 251,489 shares of the busi",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-hckt-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:31+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Acquires 243,963 Shares of Oaktree Specialty Lending Co. (NASDAQ:OCSL)",
        "description": "Harbor Capital Advisors Inc. lifted its holdings in shares of Oaktree Specialty Lending Co. (NASDAQ:OCSL - Free Report) by 148.2% during the 3rd quarter, according to the company in its most recent filing with the Securities and Exchange Commission (SEC). The institutional investor owned 408,612 s",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-ocsl-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:31+00:00"
      },
      {
        "author": null,
        "title": "OrthoPediatrics Corp. (NASDAQ:KIDS) Shares Acquired by Harbor Capital Advisors Inc.",
        "description": "Harbor Capital Advisors Inc. grew its stake in shares of OrthoPediatrics Corp. (NASDAQ:KIDS - Free Report) by 268.1% in the 3rd quarter, according to the company in its most recent Form 13F filing with the Securities &amp; Exchange Commission. The fund owned 246,860 shares of the company's stock af",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-kids-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:31+00:00"
      },
      {
        "author": null,
        "title": "SunOpta Inc. (NASDAQ:STKL) Shares Purchased by Harbor Capital Advisors Inc.",
        "description": "Harbor Capital Advisors Inc. raised its position in SunOpta Inc. (NASDAQ:STKL - Free Report) (TSE:SOY) by 127.6% during the 3rd quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The fund owned 1,063,918 shares of the company's stock after purchasing an",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-stkl-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:30+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Buys 426,495 Shares of Kennedy-Wilson Holdings, Inc. (NYSE:KW)",
        "description": "Harbor Capital Advisors Inc. grew its stake in shares of Kennedy-Wilson Holdings, Inc. (NYSE:KW - Free Report) by 225.7% during the 3rd quarter, according to the company in its most recent disclosure with the Securities &amp; Exchange Commission. The firm owned 615,496 shares of the financial servi",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-kw-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:30+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Acquires 17,105 Shares of ACI Worldwide, Inc. (NASDAQ:ACIW)",
        "description": "Harbor Capital Advisors Inc. boosted its stake in shares of ACI Worldwide, Inc. (NASDAQ:ACIW - Free Report) by 14.7% during the third quarter, according to the company in its most recent filing with the Securities &amp; Exchange Commission. The fund owned 133,681 shares of the technology company's",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-aciw-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:30+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Makes New Investment in Sila Realty Trust, Inc. (NYSE:SILA)",
        "description": "Harbor Capital Advisors Inc. purchased a new position in shares of Sila Realty Trust, Inc. (NYSE:SILA - Free Report) during the 3rd quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission (SEC). The firm purchased 274,770 shares of the company's stock, valu",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-sila-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:29+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Has $6.98 Million Holdings in ITT Inc. (NYSE:ITT)",
        "description": "Harbor Capital Advisors Inc. boosted its stake in ITT Inc. (NYSE:ITT - Free Report) by 108.4% in the third quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund owned 46,689 shares of the conglomerate's stock after purchasing an additional 24,282 sha",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-itt-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:29+00:00"
      },
      {
        "author": null,
        "title": "Jones Lang LaSalle Incorporated (NYSE:JLL) Shares Purchased by Harbor Capital Advisors Inc.",
        "description": "Harbor Capital Advisors Inc. increased its stake in Jones Lang LaSalle Incorporated (NYSE:JLL - Free Report) by 121.1% in the third quarter, according to its most recent 13F filing with the Securities &amp; Exchange Commission. The institutional investor owned 25,527 shares of the financial servic",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-jll-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:29+00:00"
      },
      {
        "author": null,
        "title": "Encompass Health Co. (NYSE:EHC) Shares Bought by Harbor Capital Advisors Inc.",
        "description": "Harbor Capital Advisors Inc. lifted its position in shares of Encompass Health Co. (NYSE:EHC - Free Report) by 104.7% in the 3rd quarter, according to its most recent filing with the Securities &amp; Exchange Commission. The fund owned 73,272 shares of the company's stock after buying an additional",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-ehc-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:29+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Acquires 44,246 Shares of Samsara Inc. (NYSE:IOT)",
        "description": "Harbor Capital Advisors Inc. raised its stake in shares of Samsara Inc. (NYSE:IOT - Free Report) by 41.5% in the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The institutional investor owned 150,775 shares of the company's",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-iot-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:28+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Has $7.26 Million Stock Holdings in Barings BDC, Inc. (NYSE:BBDC)",
        "description": "Harbor Capital Advisors Inc. increased its position in Barings BDC, Inc. (NYSE:BBDC - Free Report) by 148.6% in the 3rd quarter, according to its most recent disclosure with the Securities and Exchange Commission (SEC). The firm owned 740,559 shares of the company's stock after buying an additional",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-bbdc-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:28+00:00"
      },
      {
        "author": null,
        "title": "Air Lease Co. (NYSE:AL) Shares Purchased by Harbor Capital Advisors Inc.",
        "description": "Harbor Capital Advisors Inc. grew its position in shares of Air Lease Co. (NYSE:AL - Free Report) by 109.0% during the 3rd quarter, according to the company in its most recent filing with the SEC. The firm owned 161,127 shares of the transportation company's stock after purchasing an additional 84,",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-al-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:28+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Buys 99,168 Shares of Fluor Co. (NYSE:FLR)",
        "description": "Harbor Capital Advisors Inc. raised its stake in Fluor Co. (NYSE:FLR - Free Report) by 166.9% in the 3rd quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The institutional investor owned 158,571 shares of the construction company's stock",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-flr-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:26+00:00"
      },
      {
        "author": null,
        "title": "Harbor Capital Advisors Inc. Acquires 46,988 Shares of Parsons Co. (NYSE:PSN)",
        "description": "Harbor Capital Advisors Inc. increased its holdings in Parsons Co. (NYSE:PSN - Free Report) by 180.9% in the third quarter, according to its most recent disclosure with the Securities &amp; Exchange Commission. The institutional investor owned 72,958 shares of the company's stock after buying an a",
        "url": "https://www.marketbeat.com/instant-alerts/nyse-psn-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:26+00:00"
      },
      {
        "author": null,
        "title": "Silicon Motion Technology Co. (NASDAQ:SIMO) Shares Purchased by Harbor Capital Advisors Inc.",
        "description": "Harbor Capital Advisors Inc. lifted its stake in Silicon Motion Technology Co. (NASDAQ:SIMO - Free Report) by 95.7% in the third quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission. The firm owned 128,299 shares of the semiconductor producer's",
        "url": "https://www.marketbeat.com/instant-alerts/nasdaq-simo-sec-filing-2024-11-03/",
        "source": "lulegacy",
        "image": null,
        "category": "general",
        "language": "en",
        "country": "us",
        "published_at": "2024-11-03T13:48:26+00:00"
      }
    ]
  }

